import fight

reg = "Привет, %s. В этой игре ты отринешь свою сущность и станешь настоящим магом 🧙‍♂️. Мир на пороге уничтожения: " \
     "народ огня 🔥 развязал войну и теперь все пытаются помешать им. Именно ты станешь тем, " \
     "кто спасёт человечество ⚔️!\n" \
     "Я верю в тебя!\n\nКак твоё имя, ученик?"


menu = 'Что будешь делать?\n' \
      '/square — площадь\n' \
      '/home — лагерь\n' \
      '/stats — статистика'

tren = 'Добро пожаловать на линию обороны среди магов '

def_1 = "Ты вышел за ворота города вместе со своим отрядом. Вы отправились в путь."
def_2 = "Спустя пару часов вы встретили лагерь противников. «Всем приготовиться!» -- кричит командир отряда."

def enemy_desk(enemy: fight.Enemy):
    return f"На тебя нападает {enemy.name}!\n" \
          f"У него {enemy.hp}❤️ и {enemy.dmg}⚔️\n\n" \
          f"Что будешь делать?"

def new_lvl(player):
    return f'{player[1]}! Вы достигли нового уровня!!!'